{"keras_version": "2.0.1", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 416, 416, 3], "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_1", "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_2", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_3", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_4", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_5", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_5"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_6", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_7", "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_7"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_8", "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "axis": -1, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "epsilon": 0.001, "momentum": 0.99}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_8"}}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "kernel_constraint": null, "name": "conv2d_9", "filters": 125, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "activity_regularizer": null, "bias_constraint": null}}], "backend": "tensorflow"}