{"config": [{"config": {"batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_1", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "padding": "same", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_2", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "padding": "same", "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_3", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "padding": "same", "strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 128}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_4", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "padding": "same", "strides": [2, 2], "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 256}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_5", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "padding": "same", "strides": [2, 2], "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 512}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_6", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_6", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "padding": "same", "strides": [1, 1], "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 1024}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_7", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_7", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8", "trainable": true, "activation": "linear", "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 1024}, "class_name": "Conv2D"}, {"config": {"scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "name": "batch_normalization_8", "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_8", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_9", "trainable": true, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "filters": 125}, "class_name": "Conv2D"}], "class_name": "Sequential", "keras_version": "2.0.1", "backend": "tensorflow"}