{"backend": "tensorflow", "keras_version": "2.0.1", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 416, 416, 3], "sparse": false}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 16, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_1", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "same", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_2", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_2", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "same", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_3", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_3", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "same", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_4", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_4", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "same", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 256, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_5", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_5", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "same", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 512, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_6", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_6", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "same", "trainable": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 1024, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_7", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_7", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 1024, "activity_regularizer": null, "use_bias": false, "bias_regularizer": null, "name": "conv2d_8", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_8", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 125, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_9", "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}]}