{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_1", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 16, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_3", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_4", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 128, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_5", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_6", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 512, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_6", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_6", "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_7", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 1024, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_8", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": false, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 1024, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"center": true, "scale": true, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_8", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_9", "strides": [1, 1], "bias_constraint": null, "padding": "same", "trainable": true, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "filters": 125, "activation": "linear"}}], "keras_version": "2.0.1", "backend": "tensorflow"}