{"keras_version": "2.0.1", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 416, 416, 3], "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 16, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "same"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "same"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 64, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "same"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 128, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "same"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 256, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "same"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 512, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "padding": "same"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 1024, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": false, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 1024, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "axis": -1, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "kernel_size": [1, 1], "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 125, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}], "backend": "tensorflow"}