{"backend": "tensorflow", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_1", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 16, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 32, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_3", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 64, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_4", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 128, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_4"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_5", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 256, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_5"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_6", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 512, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [1, 1], "trainable": true, "name": "max_pooling2d_6"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_7", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 1024, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_8", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 1024, "padding": "same", "strides": [1, 1], "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "axis": -1, "trainable": true, "epsilon": 0.001, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_9", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "filters": 125, "padding": "same", "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.1", "class_name": "Sequential"}