{"backend": "tensorflow", "keras_version": "2.0.1", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_1", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_2", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_3", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 64, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_4", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_5", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 256, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_5"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_6", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 512, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "pool_size": [2, 2], "strides": [1, 1], "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_7", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 1024, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_7"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": false, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_8", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 1024, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "axis": -1, "center": true, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_8"}}, {"class_name": "Conv2D", "config": {"padding": "same", "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_9", "trainable": true, "bias_constraint": null, "kernel_size": [1, 1], "filters": 125, "data_format": "channels_last", "dilation_rate": [1, 1]}}]}