{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.1", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 16, "name": "conv2d_1", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 32, "name": "conv2d_2", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_2", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "name": "conv2d_3", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_3", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 128, "name": "conv2d_4", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_4", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 256, "name": "conv2d_5", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_5", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_5"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 512, "name": "conv2d_6", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_6", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "max_pooling2d_6", "pool_size": [2, 2], "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 1024, "name": "conv2d_7", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_7", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_7"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 1024, "name": "conv2d_8", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "scale": true, "epsilon": 0.001, "name": "batch_normalization_8", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "axis": -1}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_8"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 125, "name": "conv2d_9", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true}}]}