{"class_name": "Sequential", "keras_version": "2.0.1", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 416, 416, 3], "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 128, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 256, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_6", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_6", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 1024, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_7", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 1024, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "center": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_8", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "filters": 125, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_size": [1, 1], "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "data_format": "channels_last"}}], "backend": "tensorflow"}