{"keras_version": "2.0.1", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 416, 416, 3], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 16, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_1", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_2", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_3", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 128, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_4", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 256, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_5", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 512, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_6", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [1, 1], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 1024, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_7", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 1024, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": false, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_8", "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 125, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear"}}]}