{"config": [{"config": {"batch_input_shape": [null, 416, 416, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 16, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_5", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "name": "max_pooling2d_5"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_6", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_6", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [1, 1], "padding": "same", "pool_size": [2, 2], "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_7", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_7", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"use_bias": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_8", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_8", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_constraint": null, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "filters": 125, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "activity_regularizer": null, "name": "conv2d_9", "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}], "backend": "tensorflow", "keras_version": "2.0.1", "class_name": "Sequential"}