{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 16}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 32}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 64}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 128}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 256}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 512}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "strides": [1, 1], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 1024}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": false, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 1024}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true, "center": true, "scale": true, "momentum": 0.99, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [1, 1], "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "filters": 125}}], "keras_version": "2.0.1", "backend": "tensorflow"}