{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "batch_input_shape": [null, 416, 416, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_1", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 16}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 32}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_3", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_4", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 128}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_5", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 256}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_5"}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_6", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 512}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_6"}, "class_name": "LeakyReLU"}, {"config": {"strides": [1, 1], "padding": "same", "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_7", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 1024}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_7", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_7"}, "class_name": "LeakyReLU"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_8", "use_bias": false, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 1024}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "scale": true, "momentum": 0.99, "name": "batch_normalization_8", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_8"}, "class_name": "LeakyReLU"}, {"config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_9", "use_bias": true, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "filters": 125}, "class_name": "Conv2D"}], "keras_version": "2.0.1", "class_name": "Sequential"}