{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "config": {"filters": 16, "bias_constraint": null, "activation": "linear", "name": "conv2d_1", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_1", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_constraint": null, "activation": "linear", "name": "conv2d_2", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_2", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_constraint": null, "activation": "linear", "name": "conv2d_3", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_3", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "bias_constraint": null, "activation": "linear", "name": "conv2d_4", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_4", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 256, "bias_constraint": null, "activation": "linear", "name": "conv2d_5", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_5", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_5"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "name": "max_pooling2d_5", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 512, "bias_constraint": null, "activation": "linear", "name": "conv2d_6", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_6", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "name": "max_pooling2d_6", "pool_size": [2, 2], "strides": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 1024, "bias_constraint": null, "activation": "linear", "name": "conv2d_7", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_7", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_7"}}, {"class_name": "Conv2D", "config": {"filters": 1024, "bias_constraint": null, "activation": "linear", "name": "conv2d_8", "padding": "same", "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_8", "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_8"}}, {"class_name": "Conv2D", "config": {"filters": 125, "bias_constraint": null, "activation": "linear", "name": "conv2d_9", "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.1"}