{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.1", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 416, 416, 3]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 16, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_1", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 32, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_2", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 64, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_3", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 128, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_4", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_4", "trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 256, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_5", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_5", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_5", "trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 512, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_6", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_6", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_6", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "max_pooling2d_6", "trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 1024, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_7", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_7", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 1024, "use_bias": false, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_8", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "center": true, "name": "batch_normalization_8", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_8", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "filters": 125, "use_bias": true, "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_9", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1]}}]}