{"backend": "tensorflow", "keras_version": "2.0.1", "config": [{"config": {"batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"filters": 16, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_1", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_2", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_3", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_4", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 256, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_5", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_5", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 512, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_6", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_6", "strides": [1, 1], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 1024, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_7", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_7", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"filters": 1024, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_8", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": false, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "name": "batch_normalization_8", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "center": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"filters": 125, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "name": "conv2d_9", "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}, "class_name": "Conv2D"}], "class_name": "Sequential"}