{"config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 416, 416, 3], "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_1", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 16, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_2", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_3", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_4", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 128, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_4", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_5", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 256, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_5", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_6", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 512, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_6", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_7", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 1024, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": false, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [3, 3], "name": "conv2d_8", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 1024, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_size": [1, 1], "name": "conv2d_9", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 125, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.1", "class_name": "Sequential", "backend": "tensorflow"}