{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 16, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_1", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_2", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_3", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_4", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 256, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_5", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "same", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 512, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_6", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_6", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_6", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "same", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 1024, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_7", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_7", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [3, 3], "filters": 1024, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_8", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "axis": -1, "center": true, "scale": true, "name": "batch_normalization_8", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "trainable": true, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_8", "trainable": true}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [1, 1], "filters": 125, "padding": "same", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_9", "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1]}}], "keras_version": "2.0.1"}