{"config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 416, 416, 3], "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "config": {"filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_5", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_6", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "name": "max_pooling2d_6", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "config": {"filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_7", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_8", "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": false}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "scale": true, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"filters": 125, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_9", "data_format": "channels_last", "kernel_size": [1, 1], "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "use_bias": true}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.1"}