{"config": [{"config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 416, 416, 3]}, "class_name": "InputLayer"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_1", "bias_constraint": null, "filters": 16, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_2", "bias_constraint": null, "filters": 32, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_4", "bias_constraint": null, "filters": 128, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_5", "bias_constraint": null, "filters": 256, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_5", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"strides": [2, 2], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_6", "bias_constraint": null, "filters": 512, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_6", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_6", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"strides": [1, 1], "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_6", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_7", "bias_constraint": null, "filters": 1024, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_7", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_7", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_8", "bias_constraint": null, "filters": 1024, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_8", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_8", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "activation": "linear", "name": "conv2d_9", "bias_constraint": null, "filters": 125, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}], "keras_version": "2.0.1", "class_name": "Sequential", "backend": "tensorflow"}