{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.1", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 416, 416, 3], "name": "input_1"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 16, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_1", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 32, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_2", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 64, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_3", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_3"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 128, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_4", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 256, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_5", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_5"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "same", "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 512, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_6", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [1, 1], "padding": "same", "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 1024, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_7", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_7"}}, {"class_name": "Conv2D", "config": {"use_bias": false, "activity_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 1024, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "gamma_constraint": null, "center": true, "name": "batch_normalization_8", "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_8"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "activation": "linear", "filters": 125, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}