{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 416, 416, 3]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 16, "activity_regularizer": null, "name": "conv2d_1", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 32, "activity_regularizer": null, "name": "conv2d_2", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_2", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 64, "activity_regularizer": null, "name": "conv2d_3", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_3", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 128, "activity_regularizer": null, "name": "conv2d_4", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_4", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_4", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 256, "activity_regularizer": null, "name": "conv2d_5", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_5", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_5", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 512, "activity_regularizer": null, "name": "conv2d_6", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_6", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_6", "padding": "same"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 1024, "activity_regularizer": null, "name": "conv2d_7", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_7", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 1024, "activity_regularizer": null, "name": "conv2d_8", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_8", "gamma_constraint": null, "beta_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "filters": 125, "activity_regularizer": null, "name": "conv2d_9", "padding": "same"}}], "keras_version": "2.0.1"}