{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 416, 416, 3], "sparse": false}, "class_name": "InputLayer"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 16, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_1", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 32, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_2", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 64, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_3", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 128, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_4", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 256, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_5", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_5", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 512, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_6", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_6", "pool_size": [2, 2], "data_format": "channels_last", "strides": [1, 1]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 1024, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_7", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_8", "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": false, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 1024, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "name": "batch_normalization_8", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_9", "kernel_size": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "linear", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "filters": 125, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}], "keras_version": "2.0.1", "class_name": "Sequential"}