{"config": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 416, 416, 3], "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_1", "filters": 16, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_2", "filters": 32, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_3", "filters": 64, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_4", "filters": 128, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_5", "filters": 256, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_5", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_5"}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_6", "filters": 512, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_6", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_6"}, "class_name": "LeakyReLU"}, {"config": {"padding": "same", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_6", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_7", "filters": 1024, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_7", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_7"}, "class_name": "LeakyReLU"}, {"config": {"kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_8", "filters": 1024, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_8", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_8"}, "class_name": "LeakyReLU"}, {"config": {"kernel_size": [1, 1], "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "padding": "same", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "name": "conv2d_9", "filters": 125, "data_format": "channels_last"}, "class_name": "Conv2D"}], "keras_version": "2.0.1", "class_name": "Sequential", "backend": "tensorflow"}