{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.1", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 416, 416, 3], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 16, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 32, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 128, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 256, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 512, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 1024, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "use_bias": false, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 1024, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "filters": 125, "data_format": "channels_last", "strides": [1, 1], "trainable": true}}]}