{"backend": "tensorflow", "keras_version": "2.0.1", "class_name": "Model", "config": {"name": "vgg16", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block1_conv1", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 64}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block1_conv2", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 64}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block2_conv1", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 128}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block2_conv2", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 128}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block3_conv1", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 256}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block3_conv2", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 256}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block3_conv3", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 256}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block4_conv1", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 512}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block4_conv2", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 512}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block4_conv3", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 512}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block5_conv1", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 512}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block5_conv2", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 512}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "block5_conv3", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "filters": 512}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "class_name": "Dense", "config": {"activation": "relu", "name": "fc1", "kernel_constraint": null, "use_bias": true, "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "class_name": "Dense", "config": {"activation": "relu", "name": "fc2", "kernel_constraint": null, "use_bias": true, "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "predictions", "class_name": "Dense", "config": {"activation": "softmax", "name": "predictions", "kernel_constraint": null, "use_bias": true, "units": 1000, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "output_layers": [["predictions", 0, 0]]}}