{"keras_version": "2.0.1", "class_name": "Model", "config": {"name": "vgg16", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block1_conv1", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 64, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block1_conv2", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 128, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block2_conv1", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 128, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block2_conv2", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 256, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block3_conv1", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 256, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block3_conv2", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 256, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block3_conv3", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block4_conv1", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block4_conv2", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block4_conv3", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block5_conv1", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block5_conv2", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "filters": 512, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "block5_conv3", "activation": "relu", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "padding": "same"}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true}}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "fc1", "class_name": "Dense", "config": {"units": 4096, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "fc1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null}}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "fc2", "class_name": "Dense", "config": {"units": 4096, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "fc2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null}}, {"inbound_nodes": [[["fc2", 0, 0, {}]]], "name": "predictions", "class_name": "Dense", "config": {"units": 1000, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "predictions", "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null}}]}, "backend": "tensorflow"}