{"backend": "tensorflow", "config": {"output_layers": [["predictions", 0, 0]], "name": "vgg16", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block1_conv1", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 64, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block1_conv2", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 64, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "block1_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block2_conv1", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 128, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block2_conv2", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 128, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "block2_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block3_conv1", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 256, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block3_conv2", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 256, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block3_conv3", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 256, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "block3_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block4_conv1", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 512, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block4_conv2", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 512, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block4_conv3", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 512, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "block4_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block5_conv1", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 512, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block5_conv2", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 512, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "block5_conv3", "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "filters": 512, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "block5_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"name": "flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4096, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "fc1", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4096, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "fc2", "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"name": "predictions", "inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1000, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "predictions", "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Model", "keras_version": "2.0.1"}