{"config": {"output_layers": [["predictions", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block1_conv1", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block1_conv2", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block1_pool", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block2_conv1", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block2_conv2", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block2_pool", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block3_conv1", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block3_conv2", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block3_conv3", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block3_pool", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block4_conv1", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block4_conv2", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block4_conv3", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block4_pool", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block5_conv1", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block5_conv2", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "name": "block5_conv3", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "use_bias": true, "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "block5_pool", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten"}, "name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "units": 4096, "kernel_constraint": null, "name": "fc1", "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "fc1", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "relu", "units": 4096, "kernel_constraint": null, "name": "fc2", "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "fc2", "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "activation": "softmax", "units": 1000, "kernel_constraint": null, "name": "predictions", "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "predictions", "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "name": "vgg16", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.1"}