{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block1_conv1", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block1_conv2", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"pool_size": [2, 2], "name": "block1_pool", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block2_conv1", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block2_conv2", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"pool_size": [2, 2], "name": "block2_pool", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block3_conv1", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block3_conv2", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block3_conv3", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"pool_size": [2, 2], "name": "block3_pool", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block4_conv1", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block4_conv2", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block4_conv3", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"pool_size": [2, 2], "name": "block4_pool", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block5_conv1", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block5_conv2", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "block5_conv3", "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "kernel_size": [3, 3], "trainable": true}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"pool_size": [2, 2], "name": "block5_pool", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "flatten", "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "config": {"use_bias": true, "activity_regularizer": null, "units": 4096, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "fc1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "config": {"use_bias": true, "activity_regularizer": null, "units": 4096, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "fc2", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "predictions", "config": {"use_bias": true, "activity_regularizer": null, "units": 1000, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "predictions", "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "name": "vgg16"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.1"}