{"keras_version": "2.0.1", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "vgg16", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block1_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block1_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block1_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block1_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block1_pool", "trainable": true, "padding": "valid", "strides": [2, 2]}, "name": "block1_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 128, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block2_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block2_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 128, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block2_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block2_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block2_pool", "trainable": true, "padding": "valid", "strides": [2, 2]}, "name": "block2_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 256, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block3_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block3_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 256, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block3_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block3_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 256, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block3_conv3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block3_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block3_pool", "trainable": true, "padding": "valid", "strides": [2, 2]}, "name": "block3_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block4_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block4_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block4_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block4_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block4_conv3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block4_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block4_pool", "trainable": true, "padding": "valid", "strides": [2, 2]}, "name": "block4_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block5_conv1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block5_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block5_conv2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block5_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"padding": "same", "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "block5_conv3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1]}, "name": "block5_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block5_pool", "trainable": true, "padding": "valid", "strides": [2, 2]}, "name": "block5_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten"}, "name": "flatten", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "fc1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 4096}, "name": "fc1", "class_name": "Dense"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "fc2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 4096}, "name": "fc2", "class_name": "Dense"}, {"inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "name": "predictions", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 1000}, "name": "predictions", "class_name": "Dense"}]}, "class_name": "Model"}