{"backend": "tensorflow", "keras_version": "2.0.1", "config": {"output_layers": [["predictions", 0, 0]], "name": "vgg16", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}}, {"name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block1_conv1", "trainable": true, "kernel_constraint": null, "filters": 64, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block1_conv2", "trainable": true, "kernel_constraint": null, "filters": 64, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block2_conv1", "trainable": true, "kernel_constraint": null, "filters": 128, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block2_conv2", "trainable": true, "kernel_constraint": null, "filters": 128, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block3_conv1", "trainable": true, "kernel_constraint": null, "filters": 256, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block3_conv2", "trainable": true, "kernel_constraint": null, "filters": 256, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block3_conv3", "trainable": true, "kernel_constraint": null, "filters": 256, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block4_conv1", "trainable": true, "kernel_constraint": null, "filters": 512, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block4_conv2", "trainable": true, "kernel_constraint": null, "filters": 512, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block4_conv3", "trainable": true, "kernel_constraint": null, "filters": 512, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block5_conv1", "trainable": true, "kernel_constraint": null, "filters": 512, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block5_conv2", "trainable": true, "kernel_constraint": null, "filters": 512, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_regularizer": null, "name": "block5_conv3", "trainable": true, "kernel_constraint": null, "filters": 512, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true}}, {"name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"name": "flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten", "trainable": true}}, {"name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "name": "fc1", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 4096, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "name": "fc2", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 4096, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"name": "predictions", "inbound_nodes": [[["fc2", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "name": "predictions", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 1000, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}