{"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block1_conv1", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block1_conv2", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block1_pool", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block2_conv1", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block2_conv2", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block2_pool", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block3_conv1", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block3_conv2", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block3_conv3", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block3_pool", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block4_conv1", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block4_conv2", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block4_conv3", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block4_pool", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block5_conv1", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block5_conv2", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "name": "block5_conv3", "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 512, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "block5_pool", "padding": "valid", "trainable": true, "data_format": "channels_last"}, "name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"config": {"name": "flatten", "trainable": true}, "name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"config": {"units": 4096, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "fc1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "fc1", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"config": {"units": 4096, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "fc2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_constraint": null}, "name": "fc2", "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"config": {"units": 1000, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "predictions", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null}, "name": "predictions", "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "name": "vgg16", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "keras_version": "2.0.1", "backend": "tensorflow", "class_name": "Model"}