{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block1_conv1", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block1_conv2", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "block1_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block2_conv1", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block2_conv2", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "block2_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block3_conv1", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block3_conv2", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block3_conv3", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 256, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "block3_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block4_conv1", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 512, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block4_conv2", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 512, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block4_conv3", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 512, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "block4_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block5_conv1", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 512, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block5_conv2", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 512, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "block5_conv3", "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 512, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "block5_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "flatten", "class_name": "Flatten"}, {"config": {"trainable": true, "units": 4096, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "name": "fc1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "fc1", "class_name": "Dense"}, {"config": {"trainable": true, "units": 4096, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "name": "fc2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "fc2", "class_name": "Dense"}, {"config": {"trainable": true, "units": 1000, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "name": "predictions", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["fc2", 0, 0, {}]]], "name": "predictions", "class_name": "Dense"}], "name": "vgg16", "output_layers": [["predictions", 0, 0]]}, "keras_version": "2.0.1", "class_name": "Model", "backend": "tensorflow"}