{"keras_version": "2.0.1", "class_name": "Model", "config": {"name": "vgg16", "output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block1_conv1", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 64}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block1_conv2", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 64}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"padding": "valid", "strides": [2, 2], "name": "block1_pool", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block2_conv1", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 128}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block2_conv2", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 128}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"padding": "valid", "strides": [2, 2], "name": "block2_pool", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block3_conv1", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 256}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block3_conv2", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 256}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block3_conv3", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 256}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"padding": "valid", "strides": [2, 2], "name": "block3_pool", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block4_conv1", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 512}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block4_conv2", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 512}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block4_conv3", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 512}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"padding": "valid", "strides": [2, 2], "name": "block4_pool", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block5_conv1", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 512}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block5_conv2", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 512}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"strides": [1, 1], "data_format": "channels_last", "name": "block5_conv3", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_size": [3, 3], "filters": 512}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"padding": "valid", "strides": [2, 2], "name": "block5_pool", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"name": "fc1", "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 4096, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"name": "fc2", "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 4096, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"name": "predictions", "activation": "softmax", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 1000, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}]}, "backend": "tensorflow"}