{"keras_version": "2.0.1", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "vgg16", "output_layers": [["predictions", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"kernel_regularizer": null, "name": "block1_conv1", "bias_constraint": null, "padding": "same", "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block1_conv2", "bias_constraint": null, "padding": "same", "filters": 64, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "block1_pool", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block2_conv1", "bias_constraint": null, "padding": "same", "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block2_conv2", "bias_constraint": null, "padding": "same", "filters": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "block2_pool", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block3_conv1", "bias_constraint": null, "padding": "same", "filters": 256, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block3_conv2", "bias_constraint": null, "padding": "same", "filters": 256, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block3_conv3", "bias_constraint": null, "padding": "same", "filters": 256, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "block3_pool", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block4_conv1", "bias_constraint": null, "padding": "same", "filters": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block4_conv2", "bias_constraint": null, "padding": "same", "filters": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block4_conv3", "bias_constraint": null, "padding": "same", "filters": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "block4_pool", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block5_conv1", "bias_constraint": null, "padding": "same", "filters": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block5_conv2", "bias_constraint": null, "padding": "same", "filters": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "name": "block5_conv3", "bias_constraint": null, "padding": "same", "filters": 512, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "block5_pool", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"config": {"name": "flatten", "trainable": true}, "class_name": "Flatten", "name": "flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "fc1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 4096, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "fc2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 4096, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu"}, "class_name": "Dense", "name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "predictions", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 1000, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "softmax"}, "class_name": "Dense", "name": "predictions", "inbound_nodes": [[["fc2", 0, 0, {}]]]}]}, "backend": "tensorflow"}