{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.1", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1", "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2", "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block1_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv1", "filters": 128, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv2", "filters": 128, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block2_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv1", "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv2", "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv3", "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block3_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv1", "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv2", "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv3", "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv1", "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv2", "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv3", "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block5_pool", "pool_size": [2, 2]}}, {"class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "flatten", "config": {"trainable": true, "name": "flatten"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "fc1", "config": {"units": 4096, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "fc1", "activation": "relu"}}, {"class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "fc2", "config": {"units": 4096, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "fc2", "activation": "relu"}}, {"class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]], "name": "predictions", "config": {"units": 1000, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "predictions", "activation": "softmax"}}], "output_layers": [["predictions", 0, 0]], "name": "vgg16"}}