{"config": {"name": "vgg16", "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "name": "block1_conv1", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "name": "block1_conv2", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "block1_pool", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "name": "block2_conv1", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "name": "block2_conv2", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "block2_pool", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 256, "dilation_rate": [1, 1], "name": "block3_conv1", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 256, "dilation_rate": [1, 1], "name": "block3_conv2", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 256, "dilation_rate": [1, 1], "name": "block3_conv3", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "block3_pool", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "name": "block4_conv1", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "name": "block4_conv2", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "name": "block4_conv3", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "block4_pool", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "name": "block5_conv1", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "name": "block5_conv2", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "name": "block5_conv3", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "block5_pool", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "flatten", "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "name": "fc1", "units": 4096, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "name": "fc2", "units": 4096, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "predictions", "config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "softmax", "name": "predictions", "units": 1000, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.1"}