{"config": {"name": "vgg16", "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 64, "activity_regularizer": null, "use_bias": true, "name": "block1_conv1"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 64, "activity_regularizer": null, "use_bias": true, "name": "block1_conv2"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"name": "block1_pool", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 128, "activity_regularizer": null, "use_bias": true, "name": "block2_conv1"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 128, "activity_regularizer": null, "use_bias": true, "name": "block2_conv2"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"name": "block2_pool", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 256, "activity_regularizer": null, "use_bias": true, "name": "block3_conv1"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 256, "activity_regularizer": null, "use_bias": true, "name": "block3_conv2"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 256, "activity_regularizer": null, "use_bias": true, "name": "block3_conv3"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"name": "block3_pool", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 512, "activity_regularizer": null, "use_bias": true, "name": "block4_conv1"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 512, "activity_regularizer": null, "use_bias": true, "name": "block4_conv2"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 512, "activity_regularizer": null, "use_bias": true, "name": "block4_conv3"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"name": "block4_pool", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 512, "activity_regularizer": null, "use_bias": true, "name": "block5_conv1"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 512, "activity_regularizer": null, "use_bias": true, "name": "block5_conv2"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "filters": 512, "activity_regularizer": null, "use_bias": true, "name": "block5_conv3"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"name": "block5_pool", "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "flatten", "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 4096, "use_bias": true, "name": "fc1"}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 4096, "use_bias": true, "name": "fc2"}, "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "predictions", "config": {"kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "units": 1000, "use_bias": true, "name": "predictions"}, "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.1"}