{"class_name": "Model", "keras_version": "2.0.1", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"name": "block1_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"name": "block1_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"name": "block1_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"name": "block2_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 128, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"name": "block2_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 128, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"name": "block2_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"name": "block3_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 256, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"name": "block3_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 256, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"name": "block3_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 256, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"name": "block3_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"name": "block4_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"name": "block4_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"name": "block4_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"name": "block4_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"name": "block5_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"name": "block5_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"name": "block5_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"name": "block5_pool", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"name": "fc1", "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"name": "fc2", "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"name": "predictions", "units": 1000, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "name": "vgg16", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "backend": "tensorflow"}