{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "config": {"activity_regularizer": null, "name": "block1_conv1", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 64, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "config": {"activity_regularizer": null, "name": "block1_conv2", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 64, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "config": {"name": "block1_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "config": {"activity_regularizer": null, "name": "block2_conv1", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 128, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "config": {"activity_regularizer": null, "name": "block2_conv2", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 128, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "config": {"name": "block2_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "config": {"activity_regularizer": null, "name": "block3_conv1", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 256, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "config": {"activity_regularizer": null, "name": "block3_conv2", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 256, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "config": {"activity_regularizer": null, "name": "block3_conv3", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 256, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "config": {"name": "block3_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "config": {"activity_regularizer": null, "name": "block4_conv1", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "config": {"activity_regularizer": null, "name": "block4_conv2", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "config": {"activity_regularizer": null, "name": "block4_conv3", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "config": {"name": "block4_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "config": {"activity_regularizer": null, "name": "block5_conv1", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "config": {"activity_regularizer": null, "name": "block5_conv2", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "config": {"activity_regularizer": null, "name": "block5_conv3", "kernel_size": [3, 3], "activation": "relu", "use_bias": true, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "config": {"name": "block5_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "flatten", "config": {"name": "flatten", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "fc1", "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "name": "fc1", "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "units": 4096, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "fc2", "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "name": "fc2", "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "units": 4096, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]], "name": "predictions", "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "name": "predictions", "bias_constraint": null, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "units": 1000, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}], "output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "vgg16"}, "keras_version": "2.0.1", "backend": "tensorflow"}