{"keras_version": "2.0.1", "config": {"layers": [{"name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block1_conv1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 64, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block1_conv2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 64, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"name": "block1_pool", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block2_conv1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 128, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block2_conv2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 128, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"name": "block2_pool", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block3_conv1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 256, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block3_conv2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 256, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block3_conv3", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 256, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"name": "block3_pool", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block4_conv1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 512, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block4_conv2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 512, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block4_conv3", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 512, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"name": "block4_pool", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block5_conv1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 512, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block5_conv2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 512, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "block5_conv3", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "padding": "same", "trainable": true, "filters": 512, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"name": "block5_pool", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "flatten", "config": {"name": "flatten", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "fc1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "units": 4096, "trainable": true, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "fc2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "units": 4096, "trainable": true, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "predictions", "config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "predictions", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "units": 1000, "trainable": true, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "name": "vgg16", "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}