{"keras_version": "2.0.1", "config": {"output_layers": [["predictions", 0, 0]], "name": "vgg16", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block1_pool", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block2_pool", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 256, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block3_pool", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block4_pool", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "filters": 512, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "activity_regularizer": null}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block5_pool", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"units": 4096, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "activity_regularizer": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc2", "config": {"units": 4096, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "activity_regularizer": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"units": 1000, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "predictions", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "activity_regularizer": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}