{"config": {"output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "input_dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block1_conv1", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block1_conv2", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "config": {"strides": [2, 2], "name": "block1_pool", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block2_conv1", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 128}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block2_conv2", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 128}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "config": {"strides": [2, 2], "name": "block2_pool", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block3_conv1", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 256}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block3_conv2", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 256}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block3_conv3", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 256}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "config": {"strides": [2, 2], "name": "block3_pool", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block4_conv1", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 512}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block4_conv2", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 512}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block4_conv3", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 512}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "config": {"strides": [2, 2], "name": "block4_pool", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block5_conv1", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 512}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block5_conv2", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 512}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "config": {"activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "relu", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "name": "block5_conv3", "subsample": [1, 1], "border_mode": "same", "W_constraint": null, "nb_filter": 512}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool", "config": {"strides": [2, 2], "name": "block5_pool", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block5_pool", 0, 0]]], "name": "flatten", "config": {"trainable": true, "name": "flatten"}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten", 0, 0]]], "name": "fc1", "config": {"input_dim": 25088, "output_dim": 4096, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "relu", "W_regularizer": null, "bias": true, "b_constraint": null, "name": "fc1", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["fc1", 0, 0]]], "name": "fc2", "config": {"input_dim": 4096, "output_dim": 4096, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "relu", "W_regularizer": null, "bias": true, "b_constraint": null, "name": "fc2", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["fc2", 0, 0]]], "name": "predictions", "config": {"input_dim": 4096, "output_dim": 1000, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "activation": "softmax", "W_regularizer": null, "bias": true, "b_constraint": null, "name": "predictions", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "name": "vgg16"}, "class_name": "Model", "keras_version": "1.2.0"}